// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Console.WriteLine("Введите число:");
// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число:");
// int num2 = Convert.ToInt32(Console.ReadLine());

// double result = Math.Pow(num1,num2);
// Console.WriteLine(result);
// _______________________________________________________________________________


// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// Console.WriteLine("Введите число:");
// int num = Convert.ToInt32(Console.ReadLine());

//     int A = num / 1000;
//     int B = num % 1000 /100;
//     int C = num % 100 / 10;
//     int D = num % 100 % 10;

// int res = A+B+C+D;
// Console.WriteLine(res);

// _________________________________________________________________________________

// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


// Console.Write("Введите числа:");
//     string Text = Console.ReadLine();
//     int result = Convert.ToInt32(Text);
// return result;

